#!/bin/bash

################################################################################
# Работа с белым списком.
################################################################################

##
# Исключает пользователя из белого списка.
#
# @param string скайп-имя пользователя
##
wl_exclude_user ()
{
	local config=$(cat $WHITE_LIST_FILE | grep -v $1)
	echo $config>$WHITE_LIST_FILE
}

##
# Добавляет пользователя в белый список.
#
# @param string скайп-имя пользователя
##
wl_include_user ()
{
	wl_exclude_user $1
	echo $1 >> $WHITE_LIST_FILE
}

##
# Выводит состав белого списка.
#
# @Stdout string состав белого списка
##
wl_show ()
{
	# todo очистка списка от пустых строк
	echo "================================================================================"
	cat $WHITE_LIST_FILE | grep -v '^[[:blank:]]*$'
	echo "--------------------------------------------------------------------------------"
	echo "Всего: $(cat $WHITE_LIST_FILE | grep -v '^[[:blank:]]*$' | wc -l)"
	echo "================================================================================"
}

##
# Проверяет наличие пользователя в белом списке.
#
# @param string скайп-имя пользователя
# @return int 0-пользователя нет, 1-есть
##
wl_user_exists()
{
	if grep -Fxq $1 $WHITE_LIST_FILE
	then
		return 1
	fi

	return 0
}
